AgoraUI/app/views/auctions/_form.html.erb

      <ul>
      <% @auction.errors.full_messages.each do |message| %>
---
SELECT  "messages".* FROM "messages"  WHERE "messages"."message_id" = 'ac5dfcba-98ef-4464-831a-a226fb6eaca5' LIMIT 1