AgoraUI/app/controllers/watchlists_controller.rb

  def index
    @watchlists = Watchlist.all
---
SELECT "watchlists".* FROM "watchlists"

  def create
    id = SecureRandom.uuid.to_s

    watchlist_info = {:id => id, :watchlist_name => params[:watchlist_name].to_s}

    publish :watchlist, JSON.generate(watchlist_info)

        attempts = 0

    @message_id = nil

    message = Message.find_by(:message_id => id)
---
SELECT  "messages".* FROM "messages"  WHERE "messages"."message_id" = '33c70f51-00a7-4788-b95e-42008805d946' LIMIT 1